{"posts":[{"title":"Linux setup for Virtual Box","text":"How to install Ubuntu 18.04 LTS on VirtualBox1. Downloading Ubuntu image Open the Ubuntu website. Go to the official website https://www.ubuntu.com/download/desktop. You can download the Ubuntu disk image (also known as an ISO file) here. The recommended version is Ubuntu 20.04.2 LTS. 2. Install VirtualBox Download VirtualBox. Go to https://www.virtualbox.org/. The tutorial to install VirtualBox for both Windows and Mac is here https://www.wikihow.com/Install-VirtualBox 3. Create a Virtual Machine Click “New”. Click the blue badge in the upper-left corner of the VirtualBox window, which opens a pop-up menu. Enter a name for your virtual machine. Type whatever you want to name your virtual machine (e.g. ,Ubuntu) into the “Name” field. Select Linux as the “Type” value. Expand the “Type” drop-down menu and select Linux. Select Ubuntu as the “Version” value. Make sure Ubuntu (64-bit) is selected in the “Version” drop-down menu. Click “Next”. Select an amount of RAM to use. Drag the slider left or right to decrease or increase the amount of RAM that VirtualBox will have available for your Ubuntu virtual machine. The ideal amount of RAM is automatically selected when you get to this page. Make sure not to increase the RAM into the red region; keep the slider in the green region. Choose the File location and File size. We will be setting the disk type to VDI and the file size to be 40GB. It depends on the free space on your disk. You may apply the default settings. 4. Install Ubuntu in VirtualBox Double click the virtual machine “Ubuntu” and select your Ubuntu ISO. Click “Open”, then “Start”, then “Install Ubuntu”. Check both boxes on the “Preparing to install Ubuntu” page then “Continue”. This will ensure that everything Ubuntu needs to run will be installed. Check the “Erase disk and install Ubuntu” box then “Install Now”. This may sound scary, but don’t worry—nothing on your computer will be erased. Click Continue when prompted. This confirms that you understand the virtual machine’s virtual drive will be “erased” (there’s nothing on it anyway) and begins the Ubuntu installation process. 5. Setting up Ubuntu Select a time zone then “Continue”. Click a section that correlates with your position on the map. You may choose “Shanghai”. Enter your username, computer’s name and password. Wait for Ubuntu to finish installing. This process may take anywhere from a couple of minutes to half an hour depending on the performance of your computer. Restart the virtual machine and log in. Remember your password. Special thanks to VE280 SU2019 TA Group for this part of instruction Things to do after installation of Ubuntu1. Change apt source https://www.jianshu.com/p/5400722c369c https://mirror.tuna.tsinghua.edu.cn/help/ubuntu/ To edit source.list use command sudo vim /etc/apt/sources.list For vi/vim related commands go to https://zhuanlan.zhihu.com/p/69357225 Pay attention to Linux edition 2. Update the system sudo apt update sudo apt upgrade 3. ssh setup check ssh service: ps -e | grep ssh if not installed: sudo apt install openssh-client openssh-server sudo service ssh restart ssh-keygen add the public key to ~/.ssh/authorized_ keys (note: user-specific) (note: use ifconfig -a to check the local ip address) 4. Essential packages sudo apt install build-essential net-tools cmake git 5. Link your GitHub repo to your virtual computer!6. For other essential apps sudo snap install &lt;name&gt; 7. Set full screen and definitionInstall guest additions sudo mkdir --p /media/cdrom sudo mount -t auto /dev/cdrom /media/cdrom/ cd /media/cdrom/ sudo sh VBoxLinuxAdditions.run Set screen definition xrandr -s 1920x1440 Also applicable to Ubuntu on other virtual devices (etc. VMware, docker) 8. Personalize your UbuntuInstall zsh, the most powerful shell in Linux sudo apt install zsh git clone https://github.com/robbyrussell/oh-my-zsh.git ~/.oh-my-zsh cp ~/.oh-my-zsh/templates/zshrc.zsh-template ~/.zshrc chsh -s /bin/zsh reboot Go to ~/.zshrc and input the following 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596# Path to your oh-my-zsh installation. export ZSH=/home/.oh-my-zsh# Set name of the theme to load. Optionally, if you set this to &quot;random&quot;# it'll load a random theme each time that oh-my-zsh is loaded.# See https://github.com/robbyrussell/oh-my-zsh/wiki/Themes# zhs的ZSH_THEME=&quot;ys&quot;# Set list of themes to load# Setting this variable when ZSH_THEME=random# cause zsh load theme from this variable instead of# looking in ~/.oh-my-zsh/themes/# An empty array have no effect# ZSH_THEME_RANDOM_CANDIDATES=( &quot;robbyrussell&quot; &quot;agnoster&quot; )# Uncomment the following line to use case-sensitive completion.CASE_SENSITIVE=&quot;true&quot;# Uncomment the following line to use hyphen-insensitive completion. Case# sensitive completion must be off. _ and - will be interchangeable.HYPHEN_INSENSITIVE=&quot;true&quot;# Uncomment the following line to disable bi-weekly auto-update checks.DISABLE_AUTO_UPDATE=&quot;true&quot;# Uncomment the following line to change how often to auto-update (in days).export UPDATE_ZSH_DAYS=13# Uncomment the following line to disable colors in ls.# DISABLE_LS_COLORS=&quot;true&quot;# Uncomment the following line to disable auto-setting terminal title.# DISABLE_AUTO_TITLE=&quot;true&quot;# Uncomment the following line to enable command auto-correction.ENABLE_CORRECTION=&quot;true&quot;# Uncomment the following line to display red dots whilst waiting for completion.# COMPLETION_WAITING_DOTS=&quot;true&quot;# Uncomment the following line if you want to disable marking untracked files# under VCS as dirty. This makes repository status check for large repositories# much, much faster.DISABLE_UNTRACKED_FILES_DIRTY=&quot;true&quot;# Uncomment the following line if you want to change the command execution time# stamp shown in the history command output.# The optional three formats: &quot;mm/dd/yyyy&quot;|&quot;dd.mm.yyyy&quot;|&quot;yyyy-mm-dd&quot;# HIST_STAMPS=&quot;mm/dd/yyyy&quot;# Would you like to use another custom folder than $ZSH/custom?# ZSH_CUSTOM=/path/to/new-custom-folder# Which plugins would you like to load? (plugins can be found in ~/.oh-my-zsh/plugins/*)# Custom plugins may be added to ~/.oh-my-zsh/custom/plugins/# Example format: plugins=(rails git textmate ruby lighthouse)# Add wisely, as too many plugins slow down shell startup.plugins=( git z zsh-autosuggestions extract web-search zsh-syntax-highlighting)source $ZSH/oh-my-zsh.sh# User configuration# export MANPATH=&quot;/usr/local/man:$MANPATH&quot;# You may need to manually set your language environment# export LANG=en_US.UTF-8# Preferred editor for local and remote sessions# if [[ -n $SSH_CONNECTION ]]; then# export EDITOR='vim'# else# export EDITOR='mvim'# fi# Compilation flagsexport ARCHFLAGS=&quot;-arch x86_64&quot;# sshexport SSH_KEY_PATH=&quot;~/.ssh/rsa_id&quot;# Set personal aliases, overriding those provided by oh-my-zsh libs,# plugins, and themes. Aliases can be placed here, though oh-my-zsh# users are encouraged to define aliases within the ZSH_CUSTOM folder.# For a full list of active aliases, run `alias`.## Example aliases# alias zshconfig=&quot;mate ~/.zshrc&quot;# alias ohmyzsh=&quot;mate ~/.oh-my-zsh&quot;#source ~/.oh-my-zsh/plugins/incr/incr.zshexport UPDATE_ZSH_DAYS=1 Select a cool theme Please refer to https://www.cnblogs.com/technology178/p/13173618.html Add Chinese and install Sogou Pinyin Please refer to https://pinyin.sogou.com/linux/help.php Some other interesting apps sudo apt install indicator-multiload used to monitor system resources usage curl wttr.in used to check weather sudo apt install figlet used to perform ascii art echo love u 4ever | figlet try it out sudo apt install cmatrix used to display matrix rain cmatrix","link":"/2022/08/14/ubuntu_setup_for_vb/"},{"title":"Test","text":"口语前三个task15s/20s 准备 45s/1min 说, 因为准备时间很短，所以只写要说的几个reason中key points 模板 Yes/no, I do/don’t believe that … //My preference for… is that…(重复题干，语速慢一些声音大一些自信语调很重要) and my reasons are listed as follows. The first reason is that…. In addition, … Finally I want to emphasize that… (Consequently….(重复题目)有时间讲没时间拉倒) For one thing, … For another…. Also it should be noted that…. (In conclusion…) 如何避免卡壳：别用eh/ah/wu/en，用yeah, well, like, you know, say, 补充自己观点用which inferred/ indicates (the idea that), namely…, In fact what I want to emphasize is… 最后一个task概括lecture/ class，注意下多记点笔记，到时候对着笔记读就好 模板 The lecturer/author came up with the idea that…\\ concept of… He/she first mentioned the significance/phenomenon(from which he/she concluded…)… Later he/she claimed that… In addition/However, … he/she added/raised a question(质疑) In conclusion, all of the above contributes to the lecturer/author’s idea of… For quotation: The lecturer/author mentioned in his lecture/text that …// He/she made a very good point such that… 注：这个模板也可以用于integrated writing 阅读背单词，多读长难句保证文章看懂没压力 考试别睡着 听力多刷题，大概有idea都会问些啥问题 练速记笔记，记关键词和句子之间逻辑关系，用只要自己能看得懂的符号，中英结合 作文Integrated Writing见口语最后一个task 大作文30min 300+字，能多写尽量多写 构思五分钟，记一下三个以上reason的key words(想不到点可以辩证)，马上开始码字 千万不能有语法句法错误，不确定拼写的词换掉","link":"/2022/08/15/TOEFL/"},{"title":"Hexo theme: Icarus | The Road To Personalization","text":"Prerequisite Git Github Pages node.js Install123456789101112131415npm i hexo-cli -g// 验证是否安装成功hexo -v// 初始化文件夹hexo initnpm install// 生成静态文件hexo g// 打开本地服务器预览: localhost:4000/hexo s Deploy修改 _config.yml 配置文件最后一段 1234deploy: type: git repository: git@github.com:Maizehsu/Maizehsu.github.io.git branch: main 安装插件 npm i hexo-deployer-git ，此时 \\source\\_posts 目录下放置 .md 文档。 三板斧更新 Blog 12345678// 生成静态文件hexo g// 本地预览效果hexo s// 部署到 githubhexo d LayoutLogo左上角和左下角导航栏图标修改在 _config.icarus.yml 123# Path or URL to the website's logologo: text: Maize's Blog Favicon &amp; Titlefavicon 修改在 _config.icarus.yml ，这里用了 favicon generator from text ，字体用的是 Acme 1234# Page metadata configurationshead: # URL or path to the website's icon favicon: /img/favicon.ico 首页 title 修改在 _config.yml 1title: Maize's Blog 同样地方顺便也可以修改一下 author 1author: Maize_hsu 首页三栏，阅读页两栏，把 Recents 和 Archives 放在右边栏，在阅读模式下放回左边。新建一个 _config.post.yml 覆盖之前的配置 RSS首先用 hexo-generator-feed 插件生成 RSS 源，再通过 follow.it 托管服务，具体教程请参照这里 Navbar暂时没改，未来需要增加更多顶部栏时候再配置。导航栏右侧 icon 对应的 github 链接改成了个人网站的 repo 12345# Links to be shown on the right of the navigation barlinks: Download on GitHub: icon: fab fa-github url: https://github.com/Maizehsu/Maizehsu.github.io Footer右下角 copyright 部分暂时没打算动 Article &amp; search代码高亮和搜索暂时没打算动 WidgetWidget 是 Icarus 主题精髓部分，下面是具体配置 1234567891011121314151617181920212223242526272829303132333435position: lefttype: profile# Author nameauthor: Maize_hsu# Author titleauthor_title: Undergrad of cs @umich &amp;&amp; ece @sjtu# Author's current locationlocation: Ann Arbor, MI# URL or path to the avatar imageavatar: img/avatar.jpg# Whether show the rounded avatar imageavatar_rounded: true# Email address for the Gravatargravatar:# URL or path for the follow buttonfollow_link: https://github.com/Maizehsu# Links to be shown on the bottom of the profile widgetsocial_links: Email: icon: fas fa-envelope url: mailto:maizehsu02@gmail.com Github: icon: fab fa-github url: https://github.com/Maizehsu # Twitter: # icon: fab fa-twitter # url: https://twitter.com Linkedin: icon: fab fa-linkedin url: https://www.linkedin.com CV: download/cv_mai_xu.pdf douban: https://www.douban.com/people/199359961/ # Zhihu: # icon: fab fa-zhihu # url: https://www.zhihu.com/people/maize-hsu 其中图标可以选择使用 font-awesome 库 ，也可以用文字形式，如 1&lt;链接名称&gt;: &lt;链接的URL地址&gt; 删掉了友链和推广板块 Comment评论系统用了 gitalk ，网上教程很多就不多赘述了，配置如下 1234567comment: type: gitalk client_id: xxxx client_secret: xxxx repo: gitalk owner: Maizehsu admin: Maizehsu 统计数据Google Analytics，网上教程很多，这里也不赘述了 其他插件在 markdown 环境下渲染数学公式 1mathjax: true","link":"/2022/08/15/Icarus-Configuration/"}],"tags":[{"name":"Icarus Config","slug":"Icarus-Config","link":"/tags/Icarus-Config/"},{"name":"Tech","slug":"Tech","link":"/tags/Tech/"}],"categories":[],"pages":[]}